app/Controllers/P_datasewa.php

    public function index()
    {
        //     $data['data_sewa'] = $this->datasewa->findAll();

        //     return view('V_Pemilik/datasewa', $data);
        // }

        // Periksa apakah pengguna sudah login
        if (!session()->has('id_user')) {
            return redirect()->to('/');
        }

        // Ambil ID pengguna yang sedang login
        $id_user = session()->get('id_user');

        // Dapatkan data pengguna
        $userData = $this->m_user->find($id_user);
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '4'