app/Controllers/pemesanan.php

SELECT *
FROM `data_mobil`
WHERE `data_mobil`.`id_mobil` = '17'
SELECT *
FROM `user`
WHERE `user`.`id_user` = '41'
SELECT *
FROM `data_klien`
WHERE `id_user` = '41'
 LIMIT 1
---
    public function pemesanan($id_mobil)
    {
        // Ambil data mobil berdasarkan ID mobil yang diterima
        $mobilModel = new M_mastermobil();
        $data['data_mobil'] = $mobilModel->find($id_mobil);

        // Ambil id_pemilik dari data mobil yang sesuai
        $id_pemilik = $data['data_mobil']['id_pemilik'];


        // Ambil data pengguna yang sedang login (misalnya dari session)
        $userModel = new M_user();
        $data['user'] = $userModel->find(session('id_user'));

        // Jika pengguna memiliki data klien terkait, ambil data klien
        if ($data['user']) {
            $klienModel = new M_klien();
            $data['data_klien'] = $klienModel->where('id_user', session('id_user'))->first();

SELECT *
FROM `data_klien`
WHERE `id_user` = '41'
 LIMIT 1
SELECT *
FROM `data_sewa`
WHERE `id_pengguna` = '11'
---
    public function pesanan()
    {
        // Ambil id_user dari session
        $id_user = session('id_user');

        // Ambil id_pengguna dari tabel data_klien berdasarkan id_user
        $klienModel = new M_klien();
        $klienData = $klienModel->where('id_user', $id_user)->first();

        // Periksa apakah data pengguna ditemukan
        if (!$klienData) {
            return redirect()->back()->with('error', 'Data pengguna tidak ditemukan.');
        }

        // Ambil id_pengguna dari data pengguna
        $id_pengguna = $klienData['id_pengguna'];

        // Ambil semua data pesanan berdasarkan id_pengguna
        $dataSewaModel = new M_sewa();
        $data['data_sewa'] = $dataSewaModel->where('id_pengguna', $id_pengguna)->findAll();