app/Models/M_kontak.php

    public function getDataKontak()
    {
        return $this->findAll();
---
SELECT *
FROM `data_kontak`