app/Models/M_profil.php

    public function getDataProfil()
    {
        return $this->findAll();
---
SELECT *
FROM `data_profil`