app/Models/M_registrasipemilik.php

    public function registrasi_akun_pemilik($dataUser, $dataPemilik)
    {
        // Mulai transaksi untuk memastikan konsistensi data
        $this->db->transBegin();

        // Masukkan data user
        $this->db->table('user')->insert($dataUser);
---
INSERT INTO `user` (`username`, `password`, `role`) VALUES ('nala', 'nala123', 'pemilik_kendaraan')