app/Models/M_user.php

    public function checkLogin($username, $password)
    {
        $userData = $this->where(['username' => $username, 'password' => $password])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'dzaky'
AND `password` = 'dzaky1234'
 LIMIT 1