app/Models/MP_akun.php

SELECT `data_pemilik_kendaraan`.`id_pemilik`, `data_pemilik_kendaraan`.`nama`, `data_pemilik_kendaraan`.`tlp`, `data_pemilik_kendaraan`.`email`, `data_pemilik_kendaraan`.`foto_pemilik`, `data_pemilik_kendaraan`.`noktp`, `data_pemilik_kendaraan`.`alamat`, `data_pemilik_kendaraan`.`gender`, `data_pemilik_kendaraan`.`id_user`
FROM `data_pemilik_kendaraan`
JOIN `user` ON `data_pemilik_kendaraan`.`id_user` = `user`.`id_user`
WHERE `user`.`id_user` = '4'
---
    public function getDataPemilikByIdUser($id_user)
    {
        return $this->select('data_pemilik_kendaraan.id_pemilik, data_pemilik_kendaraan.nama,data_pemilik_kendaraan.tlp, data_pemilik_kendaraan.email, data_pemilik_kendaraan.foto_pemilik,data_pemilik_kendaraan.noktp, data_pemilik_kendaraan.alamat, data_pemilik_kendaraan.gender, data_pemilik_kendaraan.id_user')
            ->join('user', 'data_pemilik_kendaraan.id_user = user.id_user')
            ->where('user.id_user', $id_user)
            ->findAll();

SELECT `user`.`id_user`, `user`.`username`, `user`.`password`
FROM `user`
WHERE `user`.`id_user` = '4'
---
    public function getdatauser($id_user)
    {
        return $this->db->table('user')
            ->select('user.id_user, user.username, user.password')
            ->where('user.id_user', $id_user)
            ->get()
            ->getResultArray();