app/Models/MP_datamobil.php

SELECT `data_mobil`.`id_mobil`, `data_mobil`.`mobil`, `data_mobil`.`no_polisi`, `data_mobil`.`type_mobil`, `data_mobil`.`transmisi`, `data_mobil`.`kapasitas_penumpang`, `data_mobil`.`harga_sewa`, `data_mobil`.`foto_mbl`, `data_mobil`.`id_pemilik`
FROM `data_mobil`
JOIN `data_pemilik_kendaraan` ON `data_mobil`.`id_pemilik` = `data_pemilik_kendaraan`.`id_pemilik`
JOIN `user` ON `data_pemilik_kendaraan`.`id_user` = `user`.`id_user`
WHERE `data_pemilik_kendaraan`.`id_user` = '40'
---
    public function getDataMobilByIdUser($id_user)
    {
        return $this->select('data_mobil.id_mobil, data_mobil.mobil, data_mobil.no_polisi, data_mobil.type_mobil, data_mobil.transmisi, data_mobil.kapasitas_penumpang, data_mobil.harga_sewa, data_mobil.foto_mbl, data_mobil.id_pemilik')
            ->join('data_pemilik_kendaraan', 'data_mobil.id_pemilik = data_pemilik_kendaraan.id_pemilik')
            ->join('user', 'data_pemilik_kendaraan.id_user = user.id_user')
            ->where('data_pemilik_kendaraan.id_user', $id_user)
            ->findAll();