app/Models/MP_datasewa.php

SELECT `data_sewa`.`kode_sewa`, `data_sewa`.`id_pengguna`, `data_sewa`.`id_mobil`, `data_sewa`.`tgl_sewa`, `data_sewa`.`tgl_kbl`, `data_klien`.`nama`, `data_mobil`.`mobil`
FROM `data_sewa`
JOIN `data_klien` ON `data_sewa`.`id_pengguna` = `data_klien`.`id_pengguna`
JOIN `data_mobil` ON `data_sewa`.`id_mobil` = `data_mobil`.`id_mobil`
JOIN `data_pemilik_kendaraan` ON `data_sewa`.`id_pemilik` = `data_pemilik_kendaraan`.`id_pemilik`
JOIN `user` ON `data_pemilik_kendaraan`.`id_user` = `user`.`id_user`
WHERE `data_pemilik_kendaraan`.`id_user` = '4'
---
    public function getSewa($id_user)
    {
        //return $this->where('kode_sewa', $kode_sewa)->first();
        return $this->select('data_sewa.kode_sewa, data_sewa.id_pengguna, data_sewa.id_mobil, data_sewa.tgl_sewa, data_sewa.tgl_kbl, data_klien.nama, data_mobil.mobil')
            ->join('data_klien', 'data_sewa.id_pengguna = data_klien.id_pengguna')
            ->join('data_mobil', 'data_sewa.id_mobil = data_mobil.id_mobil')
            ->join('data_pemilik_kendaraan', 'data_sewa.id_pemilik = data_pemilik_kendaraan.id_pemilik')
            ->join('user', 'data_pemilik_kendaraan.id_user = user.id_user')
            ->where('data_pemilik_kendaraan.id_user', $id_user)
            ->findAll();